УТ_для_edt.РасширениеСмарт/src/Catalogs/БанковскиеСчетаОрганизаций/БанковскиеСчетаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>БанковскиеСчетаОрганизаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбменСБанкомВключен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФайлВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Программа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОтдельныйСчетГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>34</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГосударственныйКонтракт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>РучноеИзменениеРеквизитовБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетВБанкеДляРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>34</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>РучноеИзменениеРеквизитовБанкаДляРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантВыводаМесяца</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВыводитьСуммуБезКопеек</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФайлЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СрокИсполненияПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РазрешитьПлатежиБезУказанияЗаявок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b4c6f1fa-08f5-4c25-8ea0-b298b4cfc54f">
    <name>смартИспользоватьПоУмолчаниюДляВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/БанковскиеСчетаОрганизаций/Forms/ФормаЭлемента/Module.bsl
#Область ПеренесеноСДоработками

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
    
    //++ смарт:ПА #815 24.12.2021 10:30:39
    НовыйЭлемент = Элементы.Добавить("смартИспользоватьПоУмолчаниюДляВалюты", Тип("ПолеФормы"), Элементы.ГруппаИспользования);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
    НовыйЭлемент.Заголовок = "Использовать по умолчанию для валюты: "+Объект.ВалютаДенежныхСредств.Наименование;
    НовыйЭлемент.ПутьКДанным = "Объект.смартИспользоватьПоУмолчаниюДляВалюты";
    НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "ИспользоватьПоУмолчаниюПриИзменении"); 
    //-- смарт:ПА #815 24.12.2021 10:30:39
    
    //Каратеев +
    Если РольДоступна("ПолныеПрава")
        ИЛИ РольДоступна("ДобавлениеИзменениеКлассификаторовНастроекДДС") Тогда
		Элементы.смартИспользоватьПоУмолчаниюДляВалюты.Доступность = Истина;
	Иначе
		Элементы.смартИспользоватьПоУмолчаниюДляВалюты.Доступность = Ложь;
	КонецЕсли;
	//Каратеев -

КонецПроцедуры

#КонецОбласти

#Область смарт_Добавлено

//Каратеев +
&НаКлиенте
Процедура ИспользоватьПоУмолчаниюПриИзменении(Элемент) 
    
    Если Объект.смартИспользоватьПоУмолчаниюДляВалюты Тогда 
        //++ смарт:Подкин #1037 26.05.2022 16:40:46  
        ОписаниеОповещения = Новый ОписаниеОповещения("смартУстановитьУмолчание", ЭтотОбъект);
        ПоказатьВопрос(ОписаниеОповещения, "Назначить счет по-умолчанию для валюты и организации?",РежимДиалогаВопрос.ДаНет, 60);
    Иначе 
        Объект.смартИспользоватьПоУмолчаниюДляВалюты=Истина;
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Устанавливайте флажок на счет по-умолчанию(разрез Организация, Валюта), с остальных счетов флажок снимается автоматически!"); 
        //-- смарт:Подкин #1037 26.05.2022 16:40:46
    КонецЕсли;  
    
КонецПроцедуры 

//++ смарт:Подкин #1037 26.05.2022 17:22:47
&НаКлиенте
Процедура смартУстановитьУмолчание(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        ИспользоватьПоУмолчаниюПриИзмененииНаСервере(); 
        Записать();
    Иначе
       Объект.смартИспользоватьПоУмолчаниюДляВалюты=Ложь;    
       Модифицированность=Ложь;
    КонецЕсли; 
    
КонецПроцедуры//-- смарт:Подкин #1037 26.05.2022 17:22:47


&НаСервере
Процедура ИспользоватьПоУмолчаниюПриИзмененииНаСервере()
	
	Организация = Объект.Владелец; 
    
    //++ смарт:Подкин #815 24.12.2021 10:46:58
     ВалютаБС= Объект.ВалютаДенежныхСредств;
    //-- смарт:Подкин #815 24.12.2021 10:46:58
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   БанковскиеСчетаОрганизаций.Ссылка КАК БанковскийСчетОрганизации, 
        //++ смарт:Подкин #1037 26.05.2022 17:06:38
        |   БанковскиеСчетаОрганизаций.смартИспользоватьПоУмолчаниюДляВалюты КАК смартИспользоватьПоУмолчаниюДляВалюты 
        //-- смарт:Подкин #1037 26.05.2022 17:06:38
        |ИЗ
        |   Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
        |ГДЕ
        |   НЕ БанковскиеСчетаОрганизаций.ПометкаУдаления
        |   И (БанковскиеСчетаОрганизаций.Владелец = &Организация
        |           ИЛИ &Организация = НЕОПРЕДЕЛЕНО) 
        
        |   И БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств = &ВалютаБС";    
	
	Запрос.УстановитьПараметр("Организация", Организация);
    
    //++ смарт:Подкин #815 24.12.2021 10:46:40
	Запрос.УстановитьПараметр("ВалютаБС", ВалютаБС);
    //-- смарт:Подкин #815 24.12.2021 10:46:40
    
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
    Пока Выборка.Следующий() Цикл 
        //++ смарт:Подкин #1037 26.05.2022 17:09:03
        Если Не Выборка.БанковскийСчетОрганизации.Ссылка = Объект.Ссылка И Выборка.смартИспользоватьПоУмолчаниюДляВалюты Тогда 
            //-- смарт:Подкин #1037 26.05.2022 17:09:03
            
            БанковскийСчет = Выборка.БанковскийСчетОрганизации.ПолучитьОбъект();
            БанковскийСчет.смартИспользоватьПоУмолчаниюДляВалюты = Ложь;
            БанковскийСчет.Записать();
            Сообщить("Со счета "+Выборка.БанковскийСчетОрганизации.Ссылка+" снята пометка Использовать по умолчанию для валюты: "+Объект.ВалютаДенежныхСредств.Наименование);
        КонецЕсли;
    КонецЦикла;
    
	Сообщить("Счет "+Объект.Ссылка+" установлен по умолчанию");
	
КонецПроцедуры
//Каратеев -

//++ смарт:Подкин #815 24.12.2021 11:02:40
&НаКлиенте
Процедура смарт_ВалютаДенежныхСредствПриИзмененииПосле(Элемент)
    Элементы.Найти("смартИспользоватьПоУмолчаниюДляВалюты").Заголовок= "Использовать по умолчанию для валюты: "+Объект.ВалютаДенежныхСредств;  
    Если Объект.смартИспользоватьПоУмолчаниюДляВалюты Тогда
        Оповещение = Новый ОписаниеОповещения("УстановитьИспользоватьПоУмолчаниюДляВалюты",ЭтотОбъект); 
        ПоказатьВопрос(Оповещение, "Установить данный банковский счет по умолчанию для валюты: "+Объект.ВалютаДенежныхСредств,РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.Да,"Внимание вопрос:");
    КонецЕсли;
КонецПроцедуры //-- смарт:Подкин #815 24.12.2021 11:02:40

//++ смарт:Подкин #815 24.12.2021 11:02:40
&НаКлиенте
Процедура УстановитьИспользоватьПоУмолчаниюДляВалюты(Результат, Параметры) Экспорт // здесь, думаю, комментировать нечего
    Если Результат = КодВозвратаДиалога.Да Тогда
        ИспользоватьПоУмолчаниюПриИзмененииНаСервере(); 
    Иначе
       Объект.смартИспользоватьПоУмолчаниюДляВалюты=Ложь; 
    КонецЕсли; 
КонецПроцедуры //-- смарт:Подкин #815 24.12.2021 11:02:40

#КонецОбласти
